Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "checkov -f $SHOWFILE" in "/Users/hemanthgokavarapu/.atlantis/repos/InsecureCorp/terraform-gcp/21/default": exit status 1: running "checkov -f $SHOWFILE" in "/Users/hemanthgokavarapu/.atlantis/repos/InsecureCorp/terraform-gcp/21/default": 


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.0.937 
Update available 2.0.937 -> 2.1.44
Run pip3 install -U checkov to update 


terraform_plan scan results:

Passed checks: 7, Failed checks: 15, Skipped checks: 0

✅ 
    [SO](http://s.tk/)
Check: CKV_GCP_18: "Ensure GKE Control Plane is not public"
	PASSED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_10
Check: CKV_GCP_8: "Ensure Stackdriver Monitoring is set to Enabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_3
Check: CKV_GCP_1: "Ensure Stackdriver Logging is set to Enabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_1
Check: CKV_GCP_7: "Ensure Legacy Authorization is set to Disabled on Kubernetes Engine Clusters"
	PASSED for resource: google_container_cluster.primary
	File: [/default.json:0-0](https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_2)
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_2
Check: CKV_GCP_19: "Ensure GKE basic auth is disabled"
	PASSED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_11
Check: CKV_GCP_72: "Ensure Integrity Monitoring for Shielded GKE Nodes is Enabled"
	PASSED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-integrity-monitoring-for-shielded-gke-nodes-is-enabled
Check: CKV_GCP_71: "Ensure Shielded GKE Nodes are Enabled"
	PASSED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-shielded-gke-nodes-are-enabled
Check: CKV_GCP_24: "Ensure PodSecurityPolicy controller is enabled on the Kubernetes Engine Clusters"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_9
Check: CKV_GCP_61: "Enable VPC Flow Logs and Intranode Visibility"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/enable-vpc-flow-logs-and-intranode-visibility
Check: CKV_GCP_70: "Ensure the GKE Release Channel is set"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-the-gke-release-channel-is-set
Check: CKV_GCP_25: "Ensure Kubernetes Cluster is created with Private cluster enabled"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_6
Check: CKV_GCP_23: "Ensure Kubernetes Cluster is created with Alias IP ranges enabled"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_15
Check: CKV_GCP_20: "Ensure master authorized networks is set to enabled in GKE clusters"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_12
Check: CKV_GCP_21: "Ensure Kubernetes Clusters are configured with Labels"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_13
Check: CKV_GCP_13: "Ensure a client certificate is used by clients to authenticate to Kubernetes Engine Clusters"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_8
Check: CKV_GCP_67: "Ensure legacy Compute Engine instance metadata APIs are Disabled"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-legacy-compute-engine-instance-metadata-apis-are-disabled
Check: CKV_GCP_68: "Ensure Secure Boot for Shielded GKE Nodes is Enabled"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-secure-boot-for-shielded-gke-nodes-is-enabled
Check: CKV_GCP_65: "Manage Kubernetes RBAC users with Google Groups for GKE"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/manage-kubernetes-rbac-users-with-google-groups-for-gke
Check: CKV_GCP_64: "Ensure clusters are created with Private Nodes"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-clusters-are-created-with-private-nodes
Check: CKV_GCP_66: "Ensure use of Binary Authorization"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-use-of-binary-authorization
Check: CKV_GCP_69: "Ensure the GKE Metadata Server is Enabled"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/ensure-the-gke-metadata-server-is-enabled
Check: CKV_GCP_12: "Ensure Network Policy is enabled on Kubernetes Engine Clusters"
	FAILED for resource: google_container_cluster.primary
	File: /default.json:0-0
	Guide: https://docs.bridgecrew.io/docs/bc_gcp_kubernetes_7


print getting started


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + min_master_version          = "1.16.8"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "soluble-gcp-example-cluster"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = "1.16.8"
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + image_type      = (known after apply)
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
        }

      + logging_config {
          + enable_components = (known after apply)
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + spot              = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = (known after apply)
        }
    }

  # null_resource.example will be created
  + resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_name = "soluble-gcp-example-cluster"
  + endpoint     = (known after apply)
  + node_version = "1.16.8"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /Users/hemanthgokavarapu/.atlantis/repos/InsecureCorp/terraform-gcp/21/default/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/Users/hemanthgokavarapu/.atlantis/repos/InsecureCorp/terraform-gcp/21/default/default.tfplan"

```
</details>

